[
	{
		"name": "Luciid",
		"image": "1_Luciid",
		"page": "https://www.instagram.com/luciidmusic/",
		"post": "https://www.instagram.com/p/CKeA4l-HEnj/",
		"description": "Plant Bass’d Takeover 001:\n@luciidmusic\n\nOur good friend and fellow Monaghan native Luciid is first up sharing the 10 tunes he’s patiently waiting to play out once the gigging renaissance commences.\n\nThe way 2020 panned out like for so many stuttered this mans momentum after a run of support gigs in @district_8_dublin and @monroesgalway opening for @rebukemusic and @t78official respectively pre covid. He’s earned releases on the @dense_and_pika imprint @kneadedpains and dropped his ‘Fugazi’ EP on @autektone last August, and has another release with the former on the horizon.\n\nIt’s a very exciting path for Monaghan’s first real techno act and one of the country’s most promising. He’s had his numbers played out by the likes of @charlottedewittemusic, @michael_bibi_ , @saralandrydj and more. We’re very excited to share his unique, raw industrial sound with you all.\n\nThanks to @eggboy_design for the graphics 🤝"
	},
	{
		"name": "Presswork",
		"image": "2_Presswork",
		"page": "https://www.instagram.com/presswork_/",
		"post": "https://www.instagram.com/p/CKwxx1VnnBr/",
		"description": "Plant Bass’d Takeover 002:\n@presswork\n\nNext up manning the Spotify is Dublin producer Tom McGrath. He shares the 10 songs he’s ready to play come club time. He is a notable member of the exciting ring of young producers coming out of @dcudjsociety along with @pagan_909, @__highfidelity, @__fuam__ , to name but a few.\n\nRanging from techno, electro and house, his sound has earned him releases on the likes of @zone_focus, @hate_collective, and @raveresidence, as well as a fresh release on the @chokibikirecords ‘Breaks for Days Vol. 1’ compilation.\n\nTom has donned the booth at the likes of @konspiracyclub, @wigwamdublin and @opiumlivedublin on the Dublin circuit and held a support slot playing with @mark_blair__ in France.\n\nAt just 20, there is an exciting path being forged by Presswork and the sound he is crafting is without question club and festival ready. Kick your February off right.\n\nThanks again to @eggboy_design for the graphics. Check out his work."
	},
	{
		"name": "Mind The Gap",
		"image": "3_Mind-The-Gap",
		"page": "https://www.instagram.com/mindt_hegap/",
		"post": "https://www.instagram.com/p/CLDA7dsntg8/",
		"description": "Plant Bass’d Takeover 003:\n@mindt_hegap\n\nThis weeks takeover marks our first Edinburgh collab, and we are very pleased to kick start this branch with @mindt_hegap.\n\nThe club night that aims to showcase exclusively women, lgbtq+, and non-binary djs from Scotland and beyond. After kick starting in January 2020, in typical cruel covid fashion the surge of the club night was halted before it even really got started.\n\nAs a monthly series of @hectors_edinburgh, the opening nights saw performances from @steviecox_, @hollieprofitdj, @djmintox as well a supporting takeover slot at the @mashhouse for @elliotadamson last Valentines night. This is a very ambitious and exciting series with a very topical and important focus and we can’t wait to see the acts that will follow come club time.\n\nHere are the 10 tracks the @mindt_hegap crew are patiently waiting to hear play out in the @thecabaretvoltaire basement.\n\n@eggboy_design up again with the graphics"
	},
	{
		"name": "Tomas",
		"image": "4_Tomas",
		"page": "https://www.instagram.com/tomas.irl/",
		"post": "https://www.instagram.com/p/CLVCEaKH8iA/",
		"description": "Plant Bass’d Takeover 004:\n@tomas.irl\n\n@fpartyu and @visiondublin co-founder TOMÁS is our next feature on the playlist takeover.\n\nA regular at @konspiracyclub and @fpartyu Tomás' hard hitting techno cuts are on the rise with recent releases on @milkitsounds and an upcoming release on @common____ground.\n\nWith what last year should have had in store for this man, we hope that 2021 will be kinder. With sets at @lifefestival, @fuinneamh_festival, and support sets for @fjaak and @nancyliveuk under his belt, club time can’t come quick enough. Until then, here are 10 tunes that you could expect to hear in a @tomas.irl set.\n\n@eggboy_design once again"
	},
	{
		"name": "Roo Honeychild",
		"image": "5_Roo-Honeychild",
		"page": "https://www.instagram.com/roohoneychild/",
		"post": "https://www.instagram.com/p/CLnAmJvncHQ/",
		"description": "Plant Bass’d Takeover 005:\n@roohoneychild\n\nRoo Honeychild is a DJ, producer and party thrower based between Dublin and Glasgow and she is a founding member of arts and party collective @clubcomfort___.\n\n2019 was a busy year for Roo with performances across Ireland, the UK and Europe, at festivals like @alltogethernow.ie and @openearfest, as well as regular stops at @thesoundhousedublin.\n\nAlong with this came appearances on @nts_radio, @rinsestagram, @reprezentradio and @redlightradio, monthly @clubcomfort___ parties and Comfort Carnival, an award winning small festival produced by the @clubcomfort___ crew in partnership with the @dublinfringefest 2019.\n\nDespite the pandemic, Roo has kept busy improving her production skills, and has at least one significant project awaiting announcement for spring 2021. She’s determined to be first feet on the dancefloor once we can rave again.\n\nExpect juke and footwork from these 10 picks. We can’t wait to see Roo back in action!\n\n@eggboy_design Comin at ya once again."
	},
	{
		"name": "Yours Truly",
		"image": "6_Yours-Truly",
		"page": "https://www.instagram.com/trulymoore_/",
		"post": "https://www.instagram.com/p/CMLFlO-nA9v/",
		"description": "Plant Bass’d Takeover 006:\n@trulymoore_\n\nA very Happy International Women’s Day to you all from the Plant Bass’d Selektaz! And no better way to celebrate than to kick off the next batch of takeover guests with Wicklows finest, @trulymoore_ .\n\nAn innovator spanning genres from jungle to drum ‘n’ bass to electro, Yours Truly is bringing back the ghosts of ravers past.\n\nShe has spread the sounds that have influenced her working with club events in @wigwamdublin, as well as recently appearing on @rinsefrance joining @shampain____ on his resident show and @froman_ for the Lighthouse Mix series.\n\nExpect to see her name crop up on the club and festival circuit even more once the normality resumes. Here are the 10 tunes Yours Truly is ready to play out once she’s back in the booth.\n\n@eggboy_design on the graphics"
	},
	{
		"name": "Dark Disku",
		"image": "7_Dar-Disku",
		"page": "https://www.instagram.com/dardisku_records/",
		"post": "https://www.instagram.com/p/CMdCZAJn20J/",
		"description": "Plant Bass’d Takeover 007:\n@dardisku_records\n\nThe duo behind Bahrain born Dar Disku Records takeover the playlist this week for a very exciting feature.\nStanding not only as a record label, but also a DJ and art collective, Dar Disku have used their vast knowledge of middle eastern music and created some nostalgic fueled dance floor ready music that you are likely to hear played out in any vibrant club scene around the world.\n\nThe label is home to these incredibly catchy Arabic discotheque edits with productions by themselves, as well as Arabic/ Irish producer @moving0still, the Netherlands @tjade.de.vries, and @freeshelterhki regular @getsomeaaro (Aaron Maple) of Finland. It has become a continental dance music movement.\n\nReleases on the label have been played out by some very well-known heads in the industry, including @hunchmusic (Hunee), @dj_seinfeld, @jobjobse and @palmstrax, and been praised by the folks at @resident_advisor, @clashmagazine, and @mille_world. The latest collaborative edit from Moving Still and Tjade released on ‘Dar Disku 004’, Azza Kamal’s ‘Maadna Bukra’ was one of our favorite sounds of 2020.\n\nFrom Lisbon to Dublin, or Mumbai to Istanbul, the Dar Disku duo have played venues and festivals like @loveboxfestival across the globe. Their online/ radio presence has seen them feature on @ccdisco ‘s @rinsestagram residency, @nabihahiqbal ‘s BBC Radio residency, @nts_radio, as well as becoming residents themselves on @worldwide.fm .\nLet this week’s 10 selekts from Dar Disku take you on a journey through hip hop, psychedelia, disco, new beat, and more.\n\nThe ever talented @eggboy_design on graphics."
	},
	{
		"name": "Efa O'Neill",
		"image": "8_Efa-Oneill",
		"page": "https://www.instagram.com/efa_o_neill/",
		"post": "https://www.instagram.com/p/CMvGowInev9/",
		"description": "Plant Bass’d Takeover 008:\n@efa_o_neill\n\nCork’s very own Aoife O’Neill offers up this week’s selekts as we reach week 8 of the Spotify Takeover.\n\nFounder of the @outofspace808 party series which also holds down a residency on @dublindigitalradio, O’Neill has become well known for her electro and rave influenced sets.\n\nShe has been able to push this sound on the Irish festival circuit with appearances at @bodyandsoulirl, @epfestival (Anachronica/ Rave in the Woods), @alltogethernow.ie, @othervoiceslive, @openearfest, and was set to feature at last year’s installment of @lifefestival .\n\nInternational club dates in London’s @picklefactorye2 and features on bills alongside names like @prosumerama, @orla_cd, and @s_p_e_c_i_a_l_r_e_q_u_e_s_t to name but a few have followed.\n\nMost recently we seen Aoife showcase her talent on the @avafestival x @boilerroomtv takeover of @district_8_dublin just prior to pandemic times, and she has shared mixes on @nts_radio, @rinsefrance, @fourfourmagazine, and was due to appear on @hoer.berlin with @strawberriesdublin last October only for travel restrictions.\n\nWe are very happy to share 10 picks that Aoife is ready to play for her crowds when this is all over and we hope to be a part of her audience in the future!\n\nGraphic man @eggboy_design.\n\nWatch Aoife’s AVA X Boiler Room feature here: https://youtu.be/qtGDVV1AvLA"
	},
	{
		"name": "Midnight Bass",
		"image": "9_Midnight-Bass",
		"page": "https://www.instagram.com/midnightbass_edi/",
		"post": "https://www.instagram.com/p/CNC9XRzn3w1/",
		"description": "Plant Bass’d Takeover 009:\n@midnightbassclub\n\nWith only our second ever Edinburgh collaboration, we are very excited to bring you Midnight Bass as our takeover guest for week 9!\n\nScotland’s biggest drum and bass night, Midnight Bass is a community-focused party, which runs weekly in independent venues @bongoclub.edinburgh and @the_berkeley_suite, Glasgow, respectively.\n\nThe ethos of the club night - a commitment to supporting local DJs, new talent and bringing artists from all across the Drum & Bass scene together.\n\nRecent guests have included @yazzus__, @charlibrix, @drumandbassi, @indikamcr, @r3dxdj, and @mrsmagoo_dnb.\n\nThe club night was set to host a @boilerroomtv Bass & Percs feature on St. Patrick’s Day of 2020 which was called off just as the pandemic took hold.\n\nNow entering their 4th Year, Midnight Bass are working towards showcasing the work of local producers.\n\nThey recently released a Scotland V/A compilation featuring new & emerging drum & bass producers.\n\nWe’re very excited to share a bumper edition this week of 15 tunes that the Midnight Bass crew are ready to hear played out once their club space returns.\nWe hope to collaborate again real soon.\n\nStrictly Drum n Bass.\n\n@eggboy_design with another whopper graphic!"
	},
	{
		"name": "Plant Bass'd Pals",
		"image": "10_PB-Pals",
		"page": "https://www.instagram.com/plantbassddjs/",
		"post": "https://www.instagram.com/p/CNTI2uZHgWq/",
		"description": "Plant Bass’d Takeover 010:\n@plantbassddjs & pals\n\nIt is a year yesterday since we were set to stage Organized Noise 001, out the back of Seamie’s in sweet sweet Monaghan.\n\nUnfortunately we are still awaiting to kickstart our party series in Monaghan and beyond but we are determined to bring these shows to you as soon as it is safe to do so.\n\nFor a special feature this week, the lineup for Organized Noise share the tunes they would be playing for you all were the gig to go ahead.\n\nPicks from @fonzatronza (@sun.set.ships.music), @doubleduv_ (@houz_music, @_blutooth), and @soundslikebozo (@dublindigitalradio, @phevertv).\n\nSome selekts shared from the plant Bass’d crew along the way too.\n\nRave ready sounds. We will be sharing selekts from the 3 guests as the week goes on.\nFirst up is Fonzo!\n\nGraphics by: @eggboy_design"
	},
	{
		"name": "Pagan",
		"image": "11_pagan",
		"page": "https://www.instagram.com/pagan_909/",
		"post": "https://www.instagram.com/p/COJFiZpHiOb/",
		"description": "Plant Bass’d Takeover 011:\n@pagan_909\n\nWe kick off our third batch of takeover guests with an ever promising act from home(Donegal/ Dublin), Pagan.\n\nAfter bursting on to the Irish scene with club and dance tent anthems ‘Mirage’ and ‘Comet on Sundays’ in 2019, Pagan’s (Rossa Doherty) stock has not been suppressed by pandemic times as much as others.\n\n2020 saw Doherty’s first release on a major label with ‘Never Known’ on the ‘Peace, Love, Unity, Respect Vol. 4’ compilation from @lobstertheremin. Once again with this release, we were reintroduced to the euphoric club sound that Pagan’s productions have embraced in the last few years.\n\nThe turn of the year has seen Rossa already announce his debut EP, ‘Wash Away Our Fears’ on the @lobstertheremin sub-label ‘1Ø PILLS MATE’, with a further EP to be the inaugural release on @cheekymusicgroup’s sub-label ‘rrraaavvveee’ (listen to the featured single here https://cheekymusicgroup.bandcamp.com/album/butterfly).\n\nHaving already racked up sets at @yurt_city, @highervisionfestival, @lifefestival, as well as being a @konspiracyclub regular, we can expect to see the 2019 @avafestival Emerging Producer Winner continue to grow his influence beyond Irish shores.\n\nWith his sounds being complimented by the likes of @dj.boring, @justinjaymusic, and @alanfitzpatrick of late, Pagan is ready to return to the booth as soon as possible along with his growing catalogue to boot.\n\nHere are 10 tunes that have influenced the Donegal native over the last 12 months, including his latest single ‘Wash Away Our Fears’.\n\nGraphics: @eggboy_design\nWords: @inspectorcampbellbap"
	},
	{
		"name": "Skin and Blister",
		"image": "12_Skin-And-Blister",
		"page": "https://www.instagram.com/skinandblister_club/",
		"post": "https://www.instagram.com/p/COvw5YjnSiZ/",
		"description": "Plant Bass’d Takeover 012:\n@skinandblister_club\n\nFor takeover number 12 we have Dublin collective, Skin & Blister!\n\nWith a focus on platforming Dublin’s female, trans and non-binary creatives within music & arts, the Skin & Blister team are breaking boundaries within the capital and creating more opportunities for all through discussion, workshops and events.\n\nHaving established themselves mid-pandemic, the tax felt by many creatives during this time has not seen the growth of the Skin & Blister movement suppressed. In a time when many people have struggled to find inclusivity, the collective (all of whom are female DJs and designers) have created what is for now an online solution, that will without doubt grow into an influential physical space in Dublin with plans to stage DJing workshops, talks, open deck sessions, as well as club nights of their own.\n\nIt is clear how valuable such a space will become once clubland returns to Dublin’s currently dejected scene with @yamamoritengu set to become the place of worship for the project. Although it is not a foreign subject to the city with other collectives and events helping to push forward in this area, there is still not enough being done within the city or opportunities being made available for safe and equal dance floors, which S&B aims to correct.\n\nSo far, we have seen the ‘Skin & Blister in Conversation’ series bring interesting discussions around creative identity and introductions to DJing with industry heads like @akhhd and @caitfa respectively. This year’s International Women’s Day seen the crew alongside @allcityrecordsandlabel host a special virtual all-vinyl stream with Dublin selectors @rdeaaane, @cheriereeta, @crispyletttuce, @laeti_dee, and @chloefarquhar.\nOn top of this, we are treated each week to the S&B mix rotation, which highlights sets from members as well as other female, trans & non-binary DJs that have caught their recent attention.\n\nGraphics: @eggboy_design\nWords: @inspectorcampbellbap"
	},
	{
		"name": "sohotsospicy",
		"image": "13_sohotsospicy",
		"page": "https://www.instagram.com/sohotsospicy/",
		"post": "https://www.instagram.com/p/CPG47cNHeH3/",
		"description": "Plant Bass’d Takeover 013:\n@sohotsospicy\n\n@thrustcollective head girl Aoife Keane (sohotsospicy) is manning our playlist this week with four to the floor, big bass and electro!\n\nHard bass and footwork. That is the sohotsospicy sound. A sound that lies somewhere between the remnants of the bad attitude of @lsdxoxo and the Jersey club pump of @uniiqu3music.\n\nKeane has just come off the back of a rough and ready collab with @darkpmavis on @common____ground’s Talamh Records. The ‘sodarksospicy’ EP garnered high praise and boasted premieres on both @djmagofficial and @fourfourmagazine.\n\nKeane has brought her club ready sound to the Dublin circuit in venues like @wigwamdublin, @buttonfactorydub, as well as playing @epfestival and @longitudefest with @gxrlcode.\n\nThese 10 picks give a glimpse, alongside her residency shows on @dublindigitalradio, of what we could expect to hear in a sohotsospicy set.\n\nGraphics: @eggboy_design\nWords: @inspectorcampbellbap"
	},
	{
		"name": "Jack Ward",
		"image": "14_Jack-ward",
		"page": "https://www.instagram.com/jack________ward/",
		"post": "https://www.instagram.com/p/CPY5mZbnIMt/",
		"description": "Plant Bass’d Takeover 014:\n@jack________ward\n\nJack Ward shares a cheeky, eclectic selection of tunes that have influenced and inspired his lockdown and recent productions.\n\nHaving recently came across Jacks’s sound, it can be best described as a sound reminiscent of the upbeat house of @logic1000____ and Lone.\n\nThe most recent single from Ward, ‘My Angel Rocks 4th & Back’ received plaudits from the people at @resident_advisor, @invertedaudio & @faceless_magazine_. A bouncing house sound that will get you in the mood for summer festivals, or the beer gardens and garden parties that you may be limited to for the foreseeable weeks.\n\nRecent remix duty on @daisies0daisies0daisies single ‘Dido’ further implements that sound and a guest mix for @darkpmavis Donuts show on @dublindigitalradio highlights the happy-go-lucky energy that Jack brings.\n\nThis week’s tunes are fun and not to be taken too seriously, giving a similar warmth to the sound that Jack has become known for himself.\n\nGraphics again by @eggboy_design.\nWords from @inspectorcampbellbap."
	},
	{
		"name": "Miss World Edinburgh",
		"image": "15_Miss-World",
		"page": "https://www.instagram.com/missworldedinburgh/",
		"post": "https://www.instagram.com/p/CP6XyrontQd/",
		"description": "Plant Bass’d Takeover 015:\n@missworldedinburgh\n\nBack with another takeover from the all-woman DJ collective based in Edinburgh with 13 special selekts this week.\n\nMiss World is a Scottish capital based group, dedicated to uplifting women in electronic music, and making clubs more safe and welcoming spaces for all.\n\nThe group are favored residents at one of the most unique spaces in the UK, @sneakypetesclub, where their monthly club-night has hosted DJs like @itspeach_, @logic1000____, @ninalasvegas, @rawsilkdjs, @laurenhansom, and more.\n\nThe group also holds down a residency on @ehfm_live community radio, and offer workshops and support to women looking to get into DJing.\n\nInput from all 4 members with these picks that range from house to disco, to breaks and bass, as well as reggae and middle-eastern sounds!.\n\nGraphics: @eggboy_design"
	},
	{
		"name": "Carmen Electro",
		"image": "16_Carmen-Electro",
		"page": "https://www.instagram.com/carmenelectro/",
		"post": "https://www.instagram.com/p/CR881PWDvBL/",
		"description": "Plant Bass’d Takeover 016:\n@carmenelectro\n\nWith one of the coolest names in the game for sure, Carmen Electro takes over our playlist for its 16th edition!\n\nCarmen is a Finnish DJ and producer based in Berlin.\n\nHaving grown up on the dancefloors of London and Berlin, Carmen crafted her diverse taste from classic techno to rave, trance, bass music, and beyond.\n\nAfter gaining exposure through shows on Berlin's infamous HÖR radio (and becoming somewhat of a regular), and with lineups and a contribution to a VA coming in later this year, she is excited to share her music with more fellow ravers in the very near future.\n\nProviding everything stays on track Carmen will be playing in Dublin this coming September on an exciting bill hosted by @raveagainstthemachines which you can still snatch tickets for through their page.\n\nKeep a close eye on Carmen’s Feisty Recordings project run along with @deankerosin, which showcases the darker side of electro and techno with mixes from some special talent from across Europe.\n\n10 big techno, electro, trance and break hitters have been added to the playlist from Carmen as well as sharing with us an insight into the state of affairs with clubbing in Berlin right now and how it has began to open up (see graphic above)."
	},
	{
		"name": "Cartin",
		"image": "17_cartin",
		"page": "https://www.instagram.com/cartincaolan/",
		"post": "https://www.instagram.com/p/CVBTzTNjZ5z/",
		"description": "Plant Bass’d Takeover 017:\n@cartincaolan\n\nWe are back with our playlist takeover series with a feature from Derry multi instrumentalist maestro Cartin!\n\nFresh off his debut AVA Boiler Room show and a cracker of a release on the ever growingly coveted @nocturnelabel, Cartin has quickly become one of the most exciting talents to come out of Ireland.\n\nFollowing on from his debut EP on @tboneexply in 2020, Cartin has shown his ability to craft a range of electronic sounds. Last year’s Gunman EP highlighted his knack for highly energetic club ready techno and breaks.\n\nHis work on @nocturnelabel on the From Belfast with Love Compilation and his own release ‘Bunk’ brings out a more worldly club sound exploring techno, eastern patterns, and elements of gospel and funky house.\n\nRecent plaudits have seen his feature track from the Bunk EP, ‘Lost My Watch Again’, receiving the Hottest Record in the World accolade from @bbcacrosstheline.\n\nWe are excited to see what the future has in store for this man and are buzzed to share an insight into his creative mind with 10 tracks of recent influence to him!\n\nLink to playlist in our bio and track snippets in our stories.\n\n Artwork from the don @eggboy_design."
	}
]
